[{"categories":null,"content":"\u003cno value\u003e's categories","date":"2023-09-24","objectID":"/en/categories/","tags":null,"title":"","uri":"/en/categories/"},{"categories":null,"content":"\u003cno value\u003e's friends","date":"2023-09-24","objectID":"/en/friends/","tags":null,"title":"","uri":"/en/friends/"},{"categories":null,"content":"Friendly Reminder Notice\rIf you want to exchange link, please leave a comment in the above format. (personal non-commercial blogs / websites only)  Website failure, stop maintenance and improper content may be unlinked! Those websites that do not respect other people’s labor achievements, reprint without source, or malicious acts, please do not come to exchange. ","date":"2023-09-24","objectID":"/en/friends/:1:0","tags":null,"title":"","uri":"/en/friends/"},{"categories":null,"content":"\u003cno value\u003e's tags","date":"2023-09-24","objectID":"/en/tags/","tags":null,"title":"","uri":"/en/tags/"},{"categories":null,"content":"Hi, Everyone 👋 Here is my resume ","date":"2019-08-02","objectID":"/en/about/:0:1","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Liudongdong 3463264078@qq.com | Ma’anshan, Anhui | 17843124735 | CSDN | GitHub | Photography ","date":"2019-08-02","objectID":"/en/about/:1:0","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Professional skill Skills: Familiar with Java, JVM basics, Mysql (JDBC, JPA framework use), C++/C#/python programming basics Skills: Familiar with Mysql database including index, transaction, redolog/undolog/binlog mechanism Skills: Familiar with SpringBoot, Flask framework, and use of SpringJPA and Mybatis Skills: Familiar with common Linux commands, storage \u0026 cache structure, NUMA architecture, file system stack, Maven, Gradle, CMake, GDB, Shell, Git, experience in CMakeLists.txt and Shell script writing, DIY experience with Zimei Magic Mirror, NAS storage Array, unmanned vehicle Skills: Understand common commands and basic principles of Kubernetes containers, Helm tools and Docker usage Skills: Understand the distributed object storage system DAOS/Ceph, distributed converged storage OpenEBS; 2PC, RingHash\u0026JumpHash principles ","date":"2019-08-02","objectID":"/en/about/:1:1","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Project experience ","date":"2019-08-02","objectID":"/en/about/:2:0","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Internship Project: Alibaba Cloud | AIS Server | Hybrid Cloud Storage R\u0026D Engineer | June 2022 - August 2022 Main content: Cooperate with Intel SCG storage department to conduct initial exploration and verification on how DAOS can provide high-performance storage services for cloud native Main work 1: Simulate deployment and verification of DAOS Use different ECS instances to explore simulated deployment solutions, submit SPDK initialization bugs , and successfully simulate NVMe and PMEM to run DAOS, compile and configure DPDK, SPDK, DAOS, and RDMA compilation configurations, investigate HugePage parameter settings, modify and compile the IO500 test library Investigate the performance and configuration on the IO500 list, conduct ior and mdtest tests, and pass local NVMe and RPC network tests to preliminary position and analyze the route. Main work 2: Study the principles of DAOS and explore how to use it Focus on how to use DAOS and improve it, read DAOS code and papers, build a three-node K8s cluster, deploy and compare Ceph object storage and OpenEBS converged storage; write PyDAOS middleware through the libdfs interface , implement Python list operations, and increase bandwidth writing by 1.5 times ","date":"2019-08-02","objectID":"/en/about/:2:1","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Competition item: Gym management system based on Huawei NBIoT | Captain | March 2019 - August 2019 Technology stack : Liteos system + NBIOT + OceanConnect cloud platform + SpringBoot + SpringJPA + MySQL + JSP Content : Compile and burn Liteos, upload data to Huawei Cloud Platform through NBIOT, and push data to the web through RestAPI | Demonstration video Achievements : Second Prize in the Northeast Division of the National University Internet of Biotechnology Competition ","date":"2019-08-02","objectID":"/en/about/:2:2","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Research experience ","date":"2019-08-02","objectID":"/en/about/:3:0","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Research experience one: Flex-based smart glove system | Independent development | March 2021 - October 2021 Research and design and develop smart gloves based on Flex sensors for human-machine collaborative control and gesture recognition Technology stack: EmbedAI+BLE+Python+PyQT+PyTorch+Android | Repository| Number of lines of code 1w+ Content: Develop a real-time system based on PyQT and Android to achieve collection, quantification, robot control, embedded AI reasoning, and real-time recognition accuracy of 94% Achievements: Won the first prize in the 2022 China University-C4 Network Technology Challenge and the second prize in the Entrepreneurship Track. ","date":"2019-08-02","objectID":"/en/about/:3:1","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Research experience two: Robot book inventory system based on RFID and CV | Project participant | February 2022 - June 2022 Research on RFID tag-intensive scenarios and integrate RFID and CV technology to improve the accuracy of book inventory Technology Stack: CV + RFID + Python | Demo Video| Number of lines of code 1w+ Content: A deep neural network (DNN) model with multiple inputs and mixed data is designed to filter out the interference of RFID tags in other layers, and a video information extraction scheme is proposed to accurately extract book spine information using strong Link to align and match RFID - and CV based timestamps with book title sequences to avoid errors during fusion. The system’s hierarchical filtering average accuracy rate reaches 98.4%, and the average book inventory accuracy rate reaches 98.9%. Achievements: Jiuwu Zhang, Xiulong Liu, Tao Gu, Bojun Zhang, Dongdong Liu , Zijuan Liu, Keqiu Li. “An RFID and Computer Vision Fusion System for Book Inventory using Mobile Robot.” in Proc. of IEEE INFOCOM 2022| Three works by students ","date":"2019-08-02","objectID":"/en/about/:3:2","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Research experience three: RF-Camera fusion sensing system | Independent development | ACM MobiCom 21 (CCF A) December 2019 - June 2021 This is the first study to integrate RFID and CV to identify who the user is, what kind of object they are holding, and what kind of action they are drawing in a multi-person and multi-object scenario. Technology stack: C# main program + WPF interface + AI face and gesture recognition | Demonstration video| Number of lines of code 3w+ Content: Responsible for the development of RF-Camera real-time system including real gesture recognition, face recognition, object recognition and matching, the recognition and matching accuracy is over 90% | Introduction Achievements: Liu Xiulong, Liu Dongdong et al. “RFID and Camera Fusion for Recognition of Human-Object Interactions.” ACM MobiCom2| A work by a student ","date":"2019-08-02","objectID":"/en/about/:3:3","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Research experience four: Jilin University Stomatological Hospital indoor real-time multi-dimensional positioning and precise navigation system | Project leader | September 2017 - January 2019 Research the Android side positioning algorithm, and build a positioning fingerprint library including WiFi, geomagnetism, and visual orb feature points to provide a calling interface for navigation Technology stack: Android + Java + Python + AI | Demo video| Number of lines of code 1w+ Content: Read and compile the ORB-SLAM project, transplant it to Android mobile phone to run in real time, develop positioning \u0026 navigation demonstration demo program Achievements: Invention patent: “An indoor positioning method, device, system and computing device”| First person in charge of students | Copyright: “orbslam3D cloud image system”, “or-based visual feature matching positioning system”, “database-based visual map editing system”, “opencv-based Kinect real-time video stream processing system”, “based on svg Map information extraction and cropping system》 ","date":"2019-08-02","objectID":"/en/about/:3:4","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Education ","date":"2019-08-02","objectID":"/en/about/:4:0","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Tianjin University | Computer Science and Technology | Full-time Master | Department of Intelligence and Computing | September 2020 Honorary Awards: 2020 Academic Award Special Scholarship | 2021 Academic Award First Class Scholarship | Postgraduate National Scholarship | Outstanding Student Leader | Outstanding Party Branch Secretary Cloud computing course 93, big data comprehensive experiment 96, IBM Websphere certification 97 ","date":"2019-08-02","objectID":"/en/about/:4:1","tags":null,"title":"","uri":"/en/about/"},{"categories":null,"content":"Jilin University | Internet of Things | Full-time Undergraduate | School of Computer Science and Technology | Third-Graduate Postgraduate Recruitment for Professional Studies September 2016 Honor Awards: 2017 National Inspirational Scholarship | Bosch Bursary | 2018 National Inspirational Scholarship | Huawei Scholarship | 2019 National Inspirational Scholarship | CET6:551, CET4:573 ","date":"2019-08-02","objectID":"/en/about/:4:2","tags":null,"title":"","uri":"/en/about/"}]